# 如何在列表、字典、集合根据条件筛选数据

"""
In [4]: from random import randint

In [5]: data = [randint(-10,10) for i in range(10)]

In [6]: data
Out[6]: [-6, -2, -8, 4, -7, 7, -4, -4, 2, -9]

# 利用filter
In [7]: data2 = list(filter(lambda x:x<0,data))

In [8]: data2
Out[8]: [-6, -2, -8, -7, -4, -4, -9]

# 列表解析
In [11]: data3 = [x for x in data if x<0]

In [12]: data3
Out[12]: [-6, -2, -8, -7, -4, -4, -9]
"""


"""
# 随机生成一个人数为20，分数在60~100之间的字典
In [14]: d = {x:randint(60, 100) for x in range(1, 20)}

In [15]: d
Out[15]:
{1: 100,
 2: 95,
 3: 79,
 4: 87,
 5: 89,
 6: 98,
 7: 73,
 8: 92,
 9: 79,
 10: 87,
 11: 89,
 12: 95,
 13: 88,
 14: 99,
 15: 89,
 16: 60,
 17: 75,
 18: 64,
 19: 61}

# 利用字典解析，筛选出分数大于80的人
In [16]: {k:v for k,v in d.items() if v>80}
Out[16]:
{1: 100,
 2: 95,
 4: 87,
 5: 89,
 6: 98,
 8: 92,
 10: 87,
 11: 89,
 12: 95,
 13: 88,
 14: 99,
 15: 89}

In [17]:

# 集合解析

In [23]: data
Out[23]: [-6, -2, -8, 4, -7, 7, -4, -4, 2, -9]

In [24]: s = set(data)

In [26]: {x for x in s if x%3 == 0}
Out[26]: {-9, -6}
"""

