# 何如统计序列中元素的出现频率

# 方法一

"""
1. 先生成一个随机的data序列
2. 把data中的数字当成dict的key,0作为值
3. 迭代输出，没遇到一次相同的数，就加1
4. 查看结果

In [1]: from random import randint

In [2]: data = [randint(0,30) for x in range(30)]

In [3]: data
Out[3]:
[22,
 18,
 19,
 10,
 11,
 26,
 28,
 11,
 10,
 2,
 29,
 23,
 3,
 4,
 8,
 6,
 24,
 7,
 1,
 30,
 29,
 21,
 7,
 15,
 1,
 5,
 3,
 1,
 12,
 1]

In [4]: d = dict.fromkeys(data, 0)

In [5]: d
Out[5]:
{1: 0,
 2: 0,
 3: 0,
 4: 0,
 5: 0,
 6: 0,
 7: 0,
 8: 0,
 10: 0,
 11: 0,
 12: 0,
 15: 0,
 18: 0,
 19: 0,
 21: 0,
 22: 0,
 23: 0,
 24: 0,
 26: 0,
 28: 0,
 29: 0,
 30: 0}

In [6]: for i in data:
   ...:     d[i] += 1
   ...:

In [7]: d
Out[7]:
{1: 4,
 2: 1,
 3: 2,
 4: 1,
 5: 1,
 6: 1,
 7: 2,
 8: 1,
 10: 2,
 11: 2,
 12: 1,
 15: 1,
 18: 1,
 19: 1,
 21: 1,
 22: 1,
 23: 1,
 24: 1,
 26: 1,
 28: 1,
 29: 2,
 30: 1}
"""