# 何如统计序列中元素的出现频率

# 方法二

"""
利用collections下的Counter可以统计词频，也可以显示出出现频率较高的数字 

In [8]: from collections import Counter

In [9]: c2 = Counter(data)

In [10]: c2
Out[10]:
Counter({1: 4,
         2: 1,
         3: 2,
         4: 1,
         5: 1,
         6: 1,
         7: 2,
         8: 1,
         10: 2,
         11: 2,
         12: 1,
         15: 1,
         18: 1,
         19: 1,
         21: 1,
         22: 1,
         23: 1,
         24: 1,
         26: 1,
         28: 1,
         29: 2,
         30: 1})

In [11]: c2[1]
Out[11]: 4

In [12]: c2[7]
Out[12]: 2

In [13]: c2.most_common(3)
Out[13]: [(1, 4), (10, 2), (11, 2)]
"""